{"question":"AI（人工知能）を「目的志向の最適化」「統計的学習」「記号推論」「エージェント（環境内で行動する主体）」という4つの観点でそれぞれ定義し、同じシステム（例：LLMベースの対話AI）が各定義でどこまでAIと言えるか／言えないかを、反例も挙げながら論じてください。"}
{"question":"ある医療診断支援AIが高精度でも現場で使われないとします。データ分布の違い（シフト）、ラベル品質、意思決定フロー、人間の責任分界、説明可能性、規制・監査という要因を整理し、「精度を上げる」以外の介入（プロダクト設計・運用設計・評価設計）を優先順位付きで提案してください。"}
{"question":"大規模言語モデル（LLM）が「次トークン予測」だけで推論らしき挙動を示す現象を、(1)表現学習、(2)インコンテキスト学習、(3)外部ツール使用、の3層に分けて説明し、各層の限界と破綻例（失敗モード）を具体例付きで述べてください。"}
{"question":"LLMの評価として、ベンチマーク（静的テスト）とオンライン評価（A/B、ログ解析、ユーザ満足）を統合した評価設計を作ってください。Goodhartの法則と分布シフトを踏まえ、指標のリークや過学習を防ぐためのガードレール（監査・盲検・ローテーション）も含めて説明してください。"}
{"question":"LLMのための合成データ生成を、(a)蒸留（教師モデル）、(b)自己改善（self-instruct等）、(c)シミュレーション環境（ツール・世界モデル）、(d)ルール/プログラム生成、の4系統に分類し、それぞれの利点・欠点・典型的な崩壊（モード崩壊、表現の偏り、毒性増幅、事実性劣化）と、その検知・緩和策を提案してください。"}
{"question":"合成データで学習したLLMが「表面的には整合しているが現実に弱い」状態になる原因を、分布被覆率、尾部事象（レアイベント）、因果構造の欠如、評価の同質化（同じ生成器で作ったテスト）という観点から分析し、現実データ最小限で補正するアクティブラーニング戦略を設計してください。"}
{"question":"差分プライバシー（DP）の直感を、(1)なぜ必要か、(2)εの意味、(3)合成データとDPの相性（何が守られ何が守られないか）、の順に説明し、DP-SGDの導入がモデル性能・公平性・再現性に与える影響をトレードオフとして論じてください。"}
{"question":"「相関」と「因果」を区別する必要がある研究テーマを1つ設定し（例：教育介入、医療、広告、気候など自由）、ランダム化比較試験が難しい状況での因果推論設計（交絡、バックドア基準、操作変数、差分の差分、感度分析）をどのように組み合わせるか、具体的な解析計画として提示してください。"}
{"question":"確率モデルの観点から、ベイズ推論と最尤推定の違いを説明し、事前分布が「意見」ではなく「構造的仮定」として機能する例を2つ挙げてください。その上で、過度に情報的な事前が推論を歪める条件と、それを検出する手法（prior predictive check等）を述べてください。"}
{"question":"熱力学第二法則の「エントロピー増大」を、情報理論（シャノンエントロピー）と混同しがちな点を明確にしつつ、両者が数学的に似て見える理由と、どこで決定的に異なるかを説明してください。さらに、マクスウェルの悪魔がこの混同をどう利用しているかも論じてください。"}
{"question":"量子計算における「量子超越性（quantum advantage）」の主張を評価するために必要な観点を列挙し、(1)実問題での優位、(2)ノイズと誤り訂正、(3)古典アルゴリズムの追い上げ、を踏まえて、研究成果の読み解き方（過大評価を避けるチェックリスト）を作ってください。"}
{"question":"トポロジーの基本概念（連結性、穴、ホモトピー/ホモロジー）を、画像解析や材料科学などの応用（トポロジカルデータ解析）に橋渡しする形で説明し、「なぜ距離ベースの特徴量では拾えない構造が拾えるのか」を具体例で示してください。"}
{"question":"分散システムで「一貫性」と「可用性」をトレードオフする際、CAPを超えて実務で効く論点（レイテンシ予算、障害モデル、クォーラム、因果整合性、リトライ嵐、テイルレイテンシ、データ修復）を整理し、ECサイトの在庫管理を題材に設計案を3案（強整合/中間/最終整合）比較してください。"}
{"question":"制御理論（フィードバック、安定性、PID、状態空間）を、強化学習（RL）と対比しながら説明し、「モデルがある場合／ない場合」「安全性制約がある場合」にどちらの枠組みが有利かを、具体的なシステム（ドローン、化学プラント、電力需給など）を選んで論じてください。"}
{"question":"地球温暖化の「検出と帰属（detection & attribution）」はどう行われるのかを、観測データ・気候モデル・自然要因/人為要因の切り分け、という観点で説明し、よくある誤解（短期変動、地域差、都市化バイアス等）に対して科学的にどう反証・留保するべきかをまとめてください。"}
{"question":"統計力学の観点から、エントロピー増大則が「確率的主張」であることを丁寧に説明し、マクスウェルの悪魔が第二法則に反しない理由を、情報・測定・消去（ランダウアーの原理）まで含めて一貫した因果鎖で論じてください。"}
{"question":"水の密度が4℃付近で最大になる・氷が浮く・比熱が大きい等の「水の異常性」を、水素結合ネットワークと局所構造（四面体性）という観点から統一的に説明し、どの実験観測（散乱、IR/Raman、NMRなど）が何を支持するかまで述べてください。"}
{"question":"量子測定問題を、(1)コペンハーゲン的見方、(2)デコヒーレンス、(3)多世界、(4)客観収縮（例：GRW系）として比較し、それぞれが「何を説明したことになっていて、何が未解決か」を、二重スリットと遅延選択実験を題材に整理してください。"}
{"question":"一般相対論の等価原理から重力赤方偏移・重力時間遅れが出てくる流れを、数式に過度に頼らず概念で導出し、GPSの時刻補正（特殊相対論と一般相対論の両方）がなぜ必須かを、起こる誤差の方向も含めて説明してください。"}
{"question":"地球のハドレー循環・フェレル循環・極循環とジェット気流、ロスビー波の関係を、角運動量保存と地球自転（β効果）から説明し、地球の自転速度が2倍になった場合に（降水帯・砂漠帯・台風の緯度分布などが）どう変わりうるかを仮説として組み立ててください。"}
{"question":"気候感度（ECS/TCR）の違いを、放射強制力・フィードバック（プランク、雲、水蒸気、アルベド、ラプスレート等）・海洋熱取り込みの時間スケールで説明し、観測制約（過去気候・衛星観測・エネルギーバジェット法）の強みと限界を比較してください。"}
{"question":"海洋酸性化が炭酸塩系（DIC、アルカリ度、pCO2）と炭酸カルシウムの飽和度（アラゴナイト/方解石）に与える影響を、化学平衡の観点から定性的に追い、サンゴ・翼足類などの生物影響が「単純なpH低下」では語り切れない理由（栄養塩、温度、局所pH制御）まで述べてください。"}
{"question":"酵素触媒が反応速度を上げる主要因（遷移状態安定化、近接・配向効果、誘起適合、量子トンネル寄与など）を整理し、ある酵素で「どの要因が支配的か」を切り分けるための変異実験・同位体効果・温度依存性解析のデザインを提案してください。"}
{"question":"タンパク質フォールディングにおけるエネルギー地形（ファネル）という考え方を説明し、シャペロンの役割を「単に折りたたむ装置」ではなく誤凝集回避や速度論的経路制御として位置づけ、病的アミロイド形成と何が違うのかまで議論してください。"}
{"question":"進化における「性（有性生殖）」の維持を、ミュラーのラチェット、赤の女王仮説、環境変動下の適応、寄生者圧など複数の仮説で比較し、どのタイプのデータ（比較ゲノム、実験進化、系統比較など）が各仮説を支持/反証しうるかを述べてください。"}
{"question":"生態学の代替安定状態（レジームシフト）を、正のフィードバックとヒステリシスの言葉で説明し、富栄養化湖沼やサンゴ礁を例に、早期警戒指標（臨界減速、分散増大など）がなぜ効くことがあり、なぜ失敗もするのかを論じてください。"}
{"question":"神経の活動電位を、イオンチャネルの電気化学ポテンシャルとフィードバック（Naの正帰還、Kの負帰還）として説明し、髄鞘化が伝導を速める仕組みを「速度」だけでなく「エネルギー効率」の観点からも評価してください。"}
{"question":"プレートテクトニクスを駆動する主要因（スラブプル、リッジプッシュ、マントル対流など）を、観測証拠（地震波トモグラフィ、海洋地磁気縞模様、重力異常等）と整合的に説明し、金星でプレートが発達しにくい可能性を熱史・水・リソスフェア強度の観点から仮説化してください。"}
{"question":"元素合成における鉄ピークの意味を説明し、s過程とr過程の物理環境（中性子密度・時間スケール）を比較し、観測（恒星スペクトル、キロノヴァ、隕石同位体異常など）から起源を推定する論理を組み立ててください。"}
{"question":"系外惑星大気の分光観測で「生命兆候（バイオシグネチャ）」を主張する際の論点を、(1)検出可能性（雲・ヘイズ・S/N）、(2)偽陽性（光化学・地質起源）、(3)惑星環境の文脈（恒星活動・大気散逸・海の有無）に分けて整理し、最小限どの追加観測があれば主張が強くなるかを提案してください。"}
